#include "ShopUI.h"
using namespace std;

void printShopUI(int playerGold) {
    cout << "\n";
    cout << "┌────────────────────────────────────┐\n";
    cout << "|                   상점             |\n";
    cout << "|────────────────────────────────────|\n";
    cout << "| 금화: " << setw(15) << playerGold << "              |\n";
    cout << "|────────────────────────────────────|\n";
    cout << "| [1] 무기 구매       [2] 방어구 구매|\n";
    cout << "| [3] 소모품 구매     [4] 전리품 판매|\n";
    cout << "| [0] 상점 종료                      |\n";
    cout << "└────────────────────────────────────┘\n";
}